jocover/esp32_u2f/main/crypto/esp32_ed25519.c

#include "soc/hwcrypto_reg.h"
#include "soc/dport_reg.h"
#include "soc/dport_access.h"
#include "esp_private/periph_ctrl.h"
#include "esp_crypto_lock.h"
#include "esp32_ed25519.h"
#include <string.h>
#include "mbedtls/sha512.h"

// Length of the elliptic curve
#define CURVE25519_BIT_LEN 255
#define CURVE25519_BYTE_LEN 32
#define CURVE25519_WORD_LEN 8

typedef struct
{
   const void *buffer;
   size_t length;
} EddsaMessageChunk;

uint32_t curve25519Sqrt(uint32_t *r, const uint32_t *a, const uint32_t *b);
void curve25519Sqr(uint32_t *r, const uint32_t *a);

void ed25519Double(Ed25519State *state, Ed25519Point *r, const Ed25519Point *p);
void ed25519Mul(Ed25519State *state, Ed25519Point *r, const uint8_t *k, const Ed25519Point *p);

// Square root of -1 modulo p (constant)
static const uint32_t CURVE25519_SQRT_MINUS_1[8] =
    {
        0x4A0EA0B0, 0xC4EE1B27, 0xAD2FE478, 0x2F431806,
        0x3DFBD7A7, 0x2B4D0099, 0x4FC1DF0B, 0x2B832480};

// Base point B
static const Ed25519Point ED25519_B =
    {
        {0x8F25D51A, 0xC9562D60, 0x9525A7B2, 0x692CC760,
         0xFDD6DC5C, 0xC0A4E231, 0xCD6E53FE, 0x216936D3},
        {0x66666658, 0x66666666, 0x66666666, 0x66666666,
         0x66666666, 0x66666666, 0x66666666, 0x66666666},
        {0x00000001, 0x00000000, 0x00000000, 0x00000000,
         0x00000000, 0x00000000, 0x00000000, 0x00000000},
        {0xA5B7DDA3, 0x6DDE8AB3, 0x775152F5, 0x20F09F80,
         0x64ABE37D, 0x66EA4E8E, 0xD78B7665, 0x67875F0F}};

static const uint32_t ED25519_2D[8] =
    {
        0x26B2F159, 0xEBD69B94, 0x8283B156, 0x00E0149A,
        0xEEF3D130, 0x198E80F2, 0x56DFFCE7, 0x2406D9DC};

// Order of the base point L
static const uint8_t ED25519_L[33] =
    {
        0xED,
        0xD3,
        0xF5,
        0x5C,
        0x1A,
        0x63,
        0x12,
        0x58,
        0xD6,
        0x9C,
        0xF7,
        0xA2,
        0xDE,
        0xF9,
        0xDE,
        0x14,
        0x00,
        0x00,
        0x00,
        0x00,
        0x00,
        0x00,
        0x00,
        0x00,
        0x00,
        0x00,
        0x00,
        0x00,
        0x00,
        0x00,
        0x00,
        0x10,
        0x00,
};

// Pre-computed value of mu = b^(2 * k) / L with b = 2^8 and k = 32
static const uint8_t ED25519_MU[33] =
    {
        0x1B, 0x13, 0x2C, 0x0A, 0xA3, 0xE5, 0x9C, 0xED,
        0xA7, 0x29, 0x63, 0x08, 0x5D, 0x21, 0x06, 0x21,
        0xEB, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
        0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
        0x0F};

inline uint32_t htole32(uint32_t host_32bits)
{
   return host_32bits;
}


void mpi_enable_hardware_hw_op( void )
{
    esp_crypto_mpi_lock_acquire();

    /* Enable RSA hardware */
    periph_module_enable(PERIPH_RSA_MODULE);

#ifdef CONFIG_IDF_TARGET_ESP32S3
    REG_CLR_BIT(SYSTEM_RSA_PD_CTRL_REG, SYSTEM_RSA_MEM_PD);
#elif CONFIG_IDF_TARGET_ESP32S2
    DPORT_REG_CLR_BIT(DPORT_RSA_PD_CTRL_REG, DPORT_RSA_MEM_PD);
#endif

    while (DPORT_REG_READ(RSA_QUERY_CLEAN_REG) != 1) {
    }
    // Note: from enabling RSA clock to here takes about 1.3us

    REG_WRITE(RSA_INTERRUPT_REG, 0);

}


void mpi_disable_hardware_hw_op( void )
{
#ifdef CONFIG_IDF_TARGET_ESP32S3
    REG_SET_BIT(SYSTEM_RSA_PD_CTRL_REG, SYSTEM_RSA_MEM_PD);
#elif CONFIG_IDF_TARGET_ESP32S2
    DPORT_REG_SET_BIT(DPORT_RSA_PD_CTRL_REG, DPORT_RSA_PD);
#endif
    /* Disable RSA hardware */
    periph_module_disable(PERIPH_RSA_MODULE);

    esp_crypto_mpi_lock_release();
}

static inline void start_op(uint32_t op_reg)
{
    /* Clear interrupt status */
    DPORT_REG_WRITE(RSA_CLEAR_INTERRUPT_REG, 1);

    /* Note: above REG_WRITE includes a memw, so we know any writes
       to the memory blocks are also complete. */

    DPORT_REG_WRITE(op_reg, 1);
}

static inline void wait_op_complete(void)
{
    while (DPORT_REG_READ(RSA_QUERY_INTERRUPT_REG) != 1)
    { }

    /* clear the interrupt */
    DPORT_REG_WRITE(RSA_CLEAR_INTERRUPT_REG, 1);
}



void curve25519Mul(uint32_t *r, const uint32_t *a, const uint32_t *b)
{

   mpi_enable_hardware_hw_op();

   uint32_t i;

   // Set mode register
   DPORT_REG_WRITE(RSA_LENGTH_REG, 7);

   // Copy the first operand to RSA_X_MEM
   for (i = 0; i < 8; i++)
   {
      DPORT_REG_WRITE(RSA_MEM_X_BLOCK_BASE + i * 4, a[i]);
   }

   // Copy the second operand to RSA_Y_MEM
   for (i = 0; i < 8; i++)
   {
      DPORT_REG_WRITE(RSA_MEM_Y_BLOCK_BASE + i * 4, b[i]);
   }

   // Copy the modulus to RSA_M_MEM
   DPORT_REG_WRITE(RSA_MEM_M_BLOCK_BASE, 0xFFFFFFED);
   DPORT_REG_WRITE(RSA_MEM_M_BLOCK_BASE + 4, 0xFFFFFFFF);
   DPORT_REG_WRITE(RSA_MEM_M_BLOCK_BASE + 8, 0xFFFFFFFF);
   DPORT_REG_WRITE(RSA_MEM_M_BLOCK_BASE + 12, 0xFFFFFFFF);
   DPORT_REG_WRITE(RSA_MEM_M_BLOCK_BASE + 16, 0xFFFFFFFF);
   DPORT_REG_WRITE(RSA_MEM_M_BLOCK_BASE + 20, 0xFFFFFFFF);
   DPORT_REG_WRITE(RSA_MEM_M_BLOCK_BASE + 24, 0xFFFFFFFF);
   DPORT_REG_WRITE(RSA_MEM_M_BLOCK_BASE + 28, 0x7FFFFFFF);

   // Copy the pre-calculated value of R^2 mod M to RSA_Z_MEM
   DPORT_REG_WRITE(RSA_MEM_RB_BLOCK_BASE, 0x000005A4);
   DPORT_REG_WRITE(RSA_MEM_RB_BLOCK_BASE + 4, 0x00000000);
   DPORT_REG_WRITE(RSA_MEM_RB_BLOCK_BASE + 8, 0x00000000);
   DPORT_REG_WRITE(RSA_MEM_RB_BLOCK_BASE + 12, 0x00000000);
   DPORT_REG_WRITE(RSA_MEM_RB_BLOCK_BASE + 16, 0x00000000);
   DPORT_REG_WRITE(RSA_MEM_RB_BLOCK_BASE + 20, 0x00000000);
   DPORT_REG_WRITE(RSA_MEM_RB_BLOCK_BASE + 24, 0x00000000);
   DPORT_REG_WRITE(RSA_MEM_RB_BLOCK_BASE + 28, 0x00000000);

   // Write the value of M' to RSA_M_PRIME_REG
   DPORT_REG_WRITE(RSA_M_DASH_REG, 0x286BCA1B);
   // Start large-number modular multiplication
   start_op(RSA_MOD_MULT_START_REG);

   // Wait for the operation to complete
   wait_op_complete();

   // Read the result from RSA_Z_MEM
   for (i = 0; i < 8; i++)
   {
      r[i] = DPORT_SEQUENCE_REG_READ(RSA_MEM_Z_BLOCK_BASE + i * 4);
   }


   mpi_disable_hardware_hw_op();
}

void curve25519SetInt(uint32_t *a, uint32_t b)
{
   uint32_t i;

   // Set the value of the least significant word
   a[0] = b;

   // Initialize the rest of the integer
   for (i = 1; i < 8; i++)
   {
      a[i] = 0;
   }
}

void curve25519Select(uint32_t *r, const uint32_t *a, const uint32_t *b,
                      uint32_t c)
{
   uint32_t i;
   uint32_t mask;

