jocover/esp32_u2f/main/crypto/esp32_ed25519.c
   // The mask is the all-1 or all-0 word
   mask = c - 1;

   // Select between A and B
   for (i = 0; i < 8; i++)
   {
      // Constant time implementation
      r[i] = (a[i] & mask) | (b[i] & ~mask);
   }
}

void curve25519Sqr(uint32_t *r, const uint32_t *a)
{
   // Compute R = (A ^ 2) mod p
   curve25519Mul(r, a, a);
}

void curve25519Pwr2(uint32_t *r, const uint32_t *a, uint32_t n)
{
   uint32_t i;

   // Pre-compute (A ^ 2) mod p
   curve25519Sqr(r, a);

   // Compute R = (A ^ (2^n)) mod p
   for (i = 1; i < n; i++)
   {
      curve25519Sqr(r, r);
   }
}

uint32_t curve25519Comp(const uint32_t *a, const uint32_t *b)
{
   uint32_t i;
   uint32_t mask;

   // Initialize mask
   mask = 0;

   // Compare A and B
   for (i = 0; i < 8; i++)
   {
      // Constant time implementation
      mask |= a[i] ^ b[i];
   }

   // Return 0 if A = B, else 1
   return ((uint32_t)(mask | (~mask + 1))) >> 31;
}

void curve25519Red(uint32_t *r, const uint32_t *a)
{
   uint32_t i;
   uint64_t temp;
   uint32_t b[8];

   // Compute B = A + 19
   for (temp = 19, i = 0; i < 8; i++)
   {
      temp += a[i];
      b[i] = temp & 0xFFFFFFFF;
      temp >>= 32;
   }

   // Compute B = A - (2^255 - 19)
   b[7] -= 0x80000000;

   // If B < (2^255 - 19) then R = B, else R = A
   curve25519Select(r, b, a, (b[7] & 0x80000000) >> 31);
}

void curve25519Add(uint32_t *r, const uint32_t *a, const uint32_t *b)
{
   uint32_t i;
   uint64_t temp;

   // Compute R = A + B
   for (temp = 0, i = 0; i < 8; i++)
   {
      temp += a[i];
      temp += b[i];
      r[i] = temp & 0xFFFFFFFF;
      temp >>= 32;
   }

   // Perform modular reduction
   curve25519Red(r, r);
}

void curve25519Sub(uint32_t *r, const uint32_t *a, const uint32_t *b)
{
   uint32_t i;
   int64_t temp;

   // Compute R = A - 19 - B
   for (temp = -19, i = 0; i < 8; i++)
   {
      temp += a[i];
      temp -= b[i];
      r[i] = temp & 0xFFFFFFFF;
      temp >>= 32;
   }

   // Compute R = A + (2^255 - 19) - B
   r[7] += 0x80000000;

   // Perform modular reduction
   curve25519Red(r, r);
}

uint32_t curve25519Sqrt(uint32_t *r, const uint32_t *a, const uint32_t *b)
{
   uint32_t res1;
   uint32_t res2;
   uint32_t c[8];
   uint32_t u[8];
   uint32_t v[8];

   // Compute the candidate root (A / B)^((p + 3) / 8). This can be done
   // with the following trick, using a single modular powering for both the
   // inversion of B and the square root: A * B^3 * (A * B^7)^((p - 5) / 8)
   curve25519Sqr(v, b);
   curve25519Mul(v, v, b);
   curve25519Sqr(v, v);
   curve25519Mul(v, v, b);

   // Compute C = A * B^7
   curve25519Mul(c, a, v);

   // Compute U = C^((p - 5) / 8)
   curve25519Sqr(u, c);
   curve25519Mul(u, u, c); // C^(2^2 - 1)
   curve25519Sqr(u, u);
   curve25519Mul(v, u, c); // C^(2^3 - 1)
   curve25519Pwr2(u, v, 3);
   curve25519Mul(u, u, v); // C^(2^6 - 1)
   curve25519Sqr(u, u);
   curve25519Mul(v, u, c); // C^(2^7 - 1)
   curve25519Pwr2(u, v, 7);
   curve25519Mul(u, u, v); // C^(2^14 - 1)
   curve25519Sqr(u, u);
   curve25519Mul(v, u, c); // C^(2^15 - 1)
   curve25519Pwr2(u, v, 15);
   curve25519Mul(u, u, v); // C^(2^30 - 1)
   curve25519Sqr(u, u);
   curve25519Mul(v, u, c); // C^(2^31 - 1)
   curve25519Pwr2(u, v, 31);
   curve25519Mul(v, u, v); // C^(2^62 - 1)
   curve25519Pwr2(u, v, 62);
   curve25519Mul(u, u, v); // C^(2^124 - 1)
   curve25519Sqr(u, u);
   curve25519Mul(v, u, c); // C^(2^125 - 1)
   curve25519Pwr2(u, v, 125);
   curve25519Mul(u, u, v); // C^(2^250 - 1)
   curve25519Sqr(u, u);
   curve25519Sqr(u, u);
   curve25519Mul(u, u, c); // C^(2^252 - 3)

   // The first candidate root is U = A * B^3 * (A * B^7)^((p - 5) / 8)
   curve25519Mul(u, u, a);
   curve25519Sqr(v, b);
   curve25519Mul(v, v, b);
   curve25519Mul(u, u, v);

   // The second candidate root is V = U * sqrt(-1)
   curve25519Mul(v, u, CURVE25519_SQRT_MINUS_1);

   // Calculate C = B * U^2
   curve25519Sqr(c, u);
   curve25519Mul(c, c, b);

   // Check whether B * U^2 = A
   res1 = curve25519Comp(c, a);

   // Calculate C = B * V^2
   curve25519Sqr(c, v);
   curve25519Mul(c, c, b);

   // Check whether B * V^2 = A
   res2 = curve25519Comp(c, a);

   // Select the first or the second candidate root
   curve25519Select(r, u, v, res1);

   // Return 0 if the square root exists
   return res1 & res2;
}

void curve25519Copy(uint32_t *a, const uint32_t *b)
{
   uint32_t i;

   // Copy the value of the integer
   for (i = 0; i < 8; i++)
   {
      a[i] = b[i];
   }
}

void curve25519Inv(uint32_t *r, const uint32_t *a)
{
   uint32_t u[8];
   uint32_t v[8];

   // Since GF(p) is a prime field, the Fermat's little theorem can be
   // used to find the multiplicative inverse of A modulo p
   curve25519Sqr(u, a);
   curve25519Mul(u, u, a); // A^(2^2 - 1)
   curve25519Sqr(u, u);
   curve25519Mul(v, u, a); // A^(2^3 - 1)
   curve25519Pwr2(u, v, 3);
   curve25519Mul(u, u, v); // A^(2^6 - 1)
   curve25519Sqr(u, u);
   curve25519Mul(v, u, a); // A^(2^7 - 1)
   curve25519Pwr2(u, v, 7);
   curve25519Mul(u, u, v); // A^(2^14 - 1)
   curve25519Sqr(u, u);
   curve25519Mul(v, u, a); // A^(2^15 - 1)
   curve25519Pwr2(u, v, 15);
   curve25519Mul(u, u, v); // A^(2^30 - 1)
   curve25519Sqr(u, u);
   curve25519Mul(v, u, a); // A^(2^31 - 1)
   curve25519Pwr2(u, v, 31);
   curve25519Mul(v, u, v); // A^(2^62 - 1)
   curve25519Pwr2(u, v, 62);
   curve25519Mul(u, u, v); // A^(2^124 - 1)
   curve25519Sqr(u, u);
   curve25519Mul(v, u, a); // A^(2^125 - 1)
   curve25519Pwr2(u, v, 125);
   curve25519Mul(u, u, v); // A^(2^250 - 1)
   curve25519Sqr(u, u);
   curve25519Sqr(u, u);
   curve25519Mul(u, u, a); // A^(2^252 - 3)
   curve25519Sqr(u, u);
   curve25519Sqr(u, u);
   curve25519Mul(u, u, a); // A^(2^254 - 11)
   curve25519Sqr(u, u);
   curve25519Mul(r, u, a); // A^(2^255 - 21)
}

void curve25519Export(uint32_t *a, uint8_t *data)
{
   uint32_t i;

   // Convert from host byte order to little-endian byte order
   for (i = 0; i < 8; i++)
   {
      a[i] = htole32(a[i]);
   }

   // Export the octet string
   memcpy(data, a, 32);
}

void ed25519Add(Ed25519State *state, Ed25519Point *r, const Ed25519Point *p,
                const Ed25519Point *q)
{
   // Compute A = (Y1 + X1) * (Y2 + X2)
   curve25519Add(state->c, p->y, p->x);
   curve25519Add(state->d, q->y, q->x);
   curve25519Mul(state->a, state->c, state->d);
   // Compute B = (Y1 - X1) * (Y2 - X2)
   curve25519Sub(state->c, p->y, p->x);
   curve25519Sub(state->d, q->y, q->x);
   curve25519Mul(state->b, state->c, state->d);
   // Compute C = 2 * Z1 * Z2
   curve25519Mul(state->c, p->z, q->z);
   curve25519Add(state->c, state->c, state->c);
   // Compute D = (2 * d) * T1 * T2
   curve25519Mul(state->d, p->t, q->t);
   curve25519Mul(state->d, state->d, ED25519_2D);
   // Compute E = A + B
   curve25519Add(state->e, state->a, state->b);
   // Compute F = A - B
   curve25519Sub(state->f, state->a, state->b);
   // Compute G = C + D
   curve25519Add(state->g, state->c, state->d);
   // Compute H = C - D
   curve25519Sub(state->h, state->c, state->d);
   // Compute X3 = F * H
   curve25519Mul(r->x, state->f, state->h);
   // Compute Y3 = E * G
   curve25519Mul(r->y, state->e, state->g);
   // Compute Z3 = G * H
   curve25519Mul(r->z, state->g, state->h);
   // Compute T3 = E * F
   curve25519Mul(r->t, state->e, state->f);
}

void ed25519Double(Ed25519State *state, Ed25519Point *r, const Ed25519Point *p)
{
   // Compute A = X1^2
   curve25519Sqr(state->a, p->x);
   // Compute B = Y1^2
   curve25519Sqr(state->b, p->y);
   // Compute C = 2 * Z1^2
   curve25519Sqr(state->c, p->z);
   curve25519Add(state->c, state->c, state->c);
   // Compute E = A + B
   curve25519Add(state->e, state->a, state->b);
   // Compute F = E - (X1 + Y1)^2
   curve25519Add(state->f, p->x, p->y);
   curve25519Sqr(state->f, state->f);
   curve25519Sub(state->f, state->e, state->f);
   // Compute G = A - B
   curve25519Sub(state->g, state->a, state->b);
   // Compute H = C + G
   curve25519Add(state->h, state->c, state->g);
   // Compute X3 = F * H
   curve25519Mul(r->x, state->f, state->h);
   // Compute Y3 = E * G
   curve25519Mul(r->y, state->e, state->g);
   // Compute Z3 = G * H
   curve25519Mul(r->z, state->g, state->h);
   // Compute T3 = E * F
   curve25519Mul(r->t, state->e, state->f);
}

void ed25519Mul(Ed25519State *state, Ed25519Point *r,
                const uint8_t *k, const Ed25519Point *p)
{
   int32_t i;
   uint8_t b;

   // The neutral element is represented by (0, 1, 1, 0)
   curve25519SetInt(state->u.x, 0);
   curve25519SetInt(state->u.y, 1);
   curve25519SetInt(state->u.z, 1);
   curve25519SetInt(state->u.t, 0);

   // Perform scalar multiplication
   for (i = CURVE25519_BIT_LEN - 1; i >= 0; i--)
   {
      // The scalar is processed in a left-to-right fashion
      b = (k[i / 8] >> (i % 8)) & 1;

