jocover/esp32_u2f/main/crypto/esp32_ed25519.c
      // Compute U = 2 * U
      ed25519Double(state, &state->u, &state->u);
      // Compute V = U + P
      ed25519Add(state, &state->v, &state->u, p);

      // If b is set, then U = V
      curve25519Select(state->u.x, state->u.x, state->v.x, b);
      curve25519Select(state->u.y, state->u.y, state->v.y, b);
      curve25519Select(state->u.z, state->u.z, state->v.z, b);
      curve25519Select(state->u.t, state->u.t, state->v.t, b);
   }

   // Copy result
   curve25519Copy(r->x, state->u.x);
   curve25519Copy(r->y, state->u.y);
   curve25519Copy(r->z, state->u.z);
   curve25519Copy(r->t, state->u.t);
}

void ed25519Encode(Ed25519Point *p, uint8_t *data)
{

   // Retrieve affine representation
   curve25519Inv(p->z, p->z);
   curve25519Mul(p->x, p->x, p->z);
   curve25519Mul(p->y, p->y, p->z);
   curve25519SetInt(p->z, 1);
   curve25519Mul(p->t, p->x, p->y);

   // Encode the y-coordinate as a little-endian string of 32 octets. The most
   // significant bit of the final octet is always zero
   curve25519Export(p->y, data);

   // Copy the least significant bit of the x-coordinate to the most significant
   // bit of the final octet
   data[31] |= (p->x[0] & 1) << 7;
}

/**
 * @brief Derive the public key from an EdDSA private key
 * @param[in] privateKey EdDSA private key (32 bytes)
 * @param[out] publicKey EdDSA public key (32 bytes)
 * @return Error code
 **/

int ed25519GeneratePublicKey(const uint8_t *privateKey, uint8_t *publicKey)
{

   uint8_t *s;

   uint8_t digest[64];

   Ed25519State *state;

   // Check parameters
   if (privateKey == NULL || publicKey == NULL)
      return -1;

   // Allocate working state
   state = malloc(sizeof(Ed25519State));
   // Failed to allocate memory?
   if (state == NULL)
      return -1;

   memset(state, 0, sizeof(Ed25519State));

   // Hash the 32-byte private key using SHA-512
   mbedtls_sha512_context sha512Context;
   mbedtls_sha512_init(&sha512Context);
   mbedtls_sha512_starts(&sha512Context, 0);
   mbedtls_sha512_update(&sha512Context, privateKey, ED25519_PRIVATE_KEY_LEN);
   mbedtls_sha512_finish(&sha512Context, digest);
   mbedtls_sha512_free(&sha512Context);

   // Only the lower 32 bytes are used for generating the public key. Interpret
   // the buffer as the little-endian integer, forming a secret scalar s
   s = digest;

   // The lowest three bits of the first octet are cleared, the highest bit
   // of the last octet is cleared, and the second highest bit of the last
   // octet is set
   s[0] &= 0xF8;
   s[31] &= 0x7F;
   s[31] |= 0x40;

   // Perform a fixed-base scalar multiplication s * B
   ed25519Mul(state, &state->sb, s, &ED25519_B);

   // The public key A is the encoding of the point s * B
   ed25519Encode(&state->sb, publicKey);

   // Erase working state
   memset(state, 0, sizeof(Ed25519State));

   // Release working state
   free(state);

   // Successful processing
   return 0;
}

void ed25519CopyInt(uint8_t *a, const uint8_t *b, uint32_t n)
{
   uint32_t i;

   // Copy the value of the integer
   for (i = 0; i < n; i++)
   {
      a[i] = b[i];
   }
}

void ed25519SelectInt(uint8_t *r, const uint8_t *a, const uint8_t *b,
                      uint8_t c, uint32_t n)
{
   uint32_t i;
   uint8_t mask;

   // The mask is the all-1 or all-0 word
   mask = c - 1;

   // Select between A and B
   for (i = 0; i < n; i++)
   {
      // Constant time implementation
      r[i] = (a[i] & mask) | (b[i] & ~mask);
   }
}

void ed25519AddInt(uint8_t *r, const uint8_t *a, const uint8_t *b, uint32_t n)
{
   uint32_t i;
   uint16_t temp;

   // Compute R = A + B
   for (temp = 0, i = 0; i < n; i++)
   {
      temp += a[i];
      temp += b[i];
      r[i] = temp & 0xFF;
      temp >>= 8;
   }
}

uint8_t ed25519SubInt(uint8_t *r, const uint8_t *a, const uint8_t *b, uint32_t n)
{
   uint32_t i;
   int16_t temp;

   // Compute R = A - B
   for (temp = 0, i = 0; i < n; i++)
   {
      temp += a[i];
      temp -= b[i];
      r[i] = temp & 0xFF;
      temp >>= 8;
   }

   // Return 1 if the result of the subtraction is negative
   return temp & 1;
}

void ed25519MulInt(uint8_t *rl, uint8_t *rh, const uint8_t *a,
                   const uint8_t *b, uint32_t n)
{
   uint32_t i;
   uint32_t j;
   uint32_t temp;

   // Compute the low part of the multiplication
   for (temp = 0, i = 0; i < n; i++)
   {
      // The Comba's algorithm computes the products, column by column
      for (j = 0; j <= i; j++)
      {
         temp += (uint16_t)a[j] * b[i - j];
      }

      // At the bottom of each column, the final result is written to memory
      if (rl != NULL)
      {
         rl[i] = temp & 0xFF;
      }

      // Propagate the carry upwards
      temp >>= 8;
   }

   // Check whether the high part of the multiplication should be calculated
   if (rh != NULL)
   {
      // Compute the high part of the multiplication
      for (i = n; i < (2 * n); i++)
      {
         // The Comba's algorithm computes the products, column by column
         for (j = i + 1 - n; j < n; j++)
         {
            temp += (uint16_t)a[j] * b[i - j];
         }

         // At the bottom of each column, the final result is written to memory
         rh[i - n] = temp & 0xFF;

         // Propagate the carry upwards
         temp >>= 8;
      }
   }
}

void ed25519RedInt(uint8_t *r, const uint8_t *a)
{
   uint8_t c;
   uint8_t u[33];
   uint8_t v[33];

   // Compute the estimate of the quotient u = ((a / b^(k - 1)) * mu) / b^(k + 1)
   ed25519MulInt(NULL, u, a + 31, ED25519_MU, 33);
   // Compute v = u * L mod b^(k + 1)
   ed25519MulInt(v, NULL, u, ED25519_L, 33);

   // Compute the estimate of the remainder u = a mod b^(k + 1) - v
   // If u < 0, then u = u + b^(k + 1)
   ed25519SubInt(u, a, v, 33);

   // This estimation implies that at most two subtractions of L are required to
   // obtain the correct remainder r
   c = ed25519SubInt(v, u, ED25519_L, 33);
   ed25519SelectInt(u, v, u, c, 33);
   c = ed25519SubInt(v, u, ED25519_L, 33);
   ed25519SelectInt(u, v, u, c, 33);

