jocover/esp32_u2f/main/crypto/esp32_ed25519.c
   // Copy the resulting remainder
   ed25519CopyInt(r, u, 32);
}

int ed25519GenerateSignatureEx(const uint8_t *privateKey,
                               const uint8_t *publicKey, const EddsaMessageChunk *messageChunks,
                               const void *context, uint8_t contextLen, uint8_t flag, uint8_t *signature)
{
   uint32_t i;
   uint8_t c;
   uint8_t digest[64];
   Ed25519State *state;
   mbedtls_sha512_context sha512Scontext;

   // Check parameters
   if (privateKey == NULL || signature == NULL)
      return -1;
   if (messageChunks == NULL)
      return -1;
   if (context == NULL && contextLen != 0)
      return -1;

   state = malloc(sizeof(Ed25519State));

   // Failed to allocate memory?
   if (state == NULL)
      return -1;
   memset(state, 0, sizeof(Ed25519State));

   // Hash the private key, 32 octets, using SHA-512. Let h denote the
   // resulting digest

   mbedtls_sha512_init(&sha512Scontext);
   mbedtls_sha512_starts(&sha512Scontext, 0);
   mbedtls_sha512_update(&sha512Scontext, privateKey, ED25519_PRIVATE_KEY_LEN);
   mbedtls_sha512_finish(&sha512Scontext, digest);
   mbedtls_sha512_free(&sha512Scontext);

   // Construct the secret scalar s from the first half of the digest
   memcpy(state->s, digest, 32);

   // The lowest three bits of the first octet are cleared, the highest bit
   // of the last octet is cleared, and the second highest bit of the last
   // octet is set
   state->s[0] &= 0xF8;
   state->s[31] &= 0x7F;
   state->s[31] |= 0x40;

   // The public key is optional
   if (publicKey == NULL)
   {
      // Perform a fixed-base scalar multiplication s * B
      ed25519Mul(state, &state->sb, state->s, &ED25519_B);
      // The public key A is the encoding of the point s * B
      ed25519Encode(&state->sb, state->k);
      // Point to the resulting public key
      publicKey = state->k;
   }

   // Let prefix denote the second half of the hash digest
   memcpy(state->p, digest + 32, 32);

   // Initialize SHA-512 context
   mbedtls_sha512_init(&sha512Scontext);
   mbedtls_sha512_starts(&sha512Scontext, 0);

   // For Ed25519ctx and Ed25519ph schemes, dom2(x, y) is the octet string
   //"SigEd25519 no Ed25519 collisions" || octet(x) || octet(OLEN(y)) || y,
   // where x is in range 0-255 and y is an octet string of at most 255 octets
   if (context != NULL || flag != 0)
   {
      mbedtls_sha512_update(&sha512Scontext, (const uint8_t *)"SigEd25519 no Ed25519 collisions", 32);
      mbedtls_sha512_update(&sha512Scontext, &flag, sizeof(uint8_t));
      mbedtls_sha512_update(&sha512Scontext, &contextLen, sizeof(uint8_t));
      mbedtls_sha512_update(&sha512Scontext, context, contextLen);
   }

   // Digest prefix
   mbedtls_sha512_update(&sha512Scontext, state->p, 32);

   // The message is split over multiple chunks
   for (i = 0; messageChunks[i].buffer != NULL; i++)
   {
      // Digest current chunk
      mbedtls_sha512_update(&sha512Scontext, messageChunks[i].buffer,
                            messageChunks[i].length);
   }

   // Compute SHA-512(dom2(F, C) || prefix || PH(M))
   mbedtls_sha512_finish(&sha512Scontext, digest);
   mbedtls_sha512_free(&sha512Scontext);

   // Reduce the 64-octet digest as a little-endian integer r
   ed25519RedInt(state->r, digest);
   // Compute the point r * B
   ed25519Mul(state, &state->rb, state->r, &ED25519_B);
   // Let the string R be the encoding of this point
   ed25519Encode(&state->rb, signature);

   // Initialize SHA-512 context
   mbedtls_sha512_init(&sha512Scontext);
   mbedtls_sha512_starts(&sha512Scontext, 0);

   // For Ed25519ctx and Ed25519ph schemes, dom2(x, y) is the octet string
   //"SigEd25519 no Ed25519 collisions" || octet(x) || octet(OLEN(y)) || y,
   // where x is in range 0-255 and y is an octet string of at most 255 octets
   if (context != NULL || flag != 0)
   {
      mbedtls_sha512_update(&sha512Scontext, (const uint8_t *)"SigEd25519 no Ed25519 collisions", 32);
      mbedtls_sha512_update(&sha512Scontext, &flag, sizeof(uint8_t));
      mbedtls_sha512_update(&sha512Scontext, &contextLen, sizeof(uint8_t));
      mbedtls_sha512_update(&sha512Scontext, context, contextLen);
   }

   // Digest R || A
   mbedtls_sha512_update(&sha512Scontext, signature, ED25519_SIGNATURE_LEN / 2);
   mbedtls_sha512_update(&sha512Scontext, publicKey, ED25519_PUBLIC_KEY_LEN);

   // The message is split over multiple chunks
   for (i = 0; messageChunks[i].buffer != NULL; i++)
   {
      // Digest current chunk
      mbedtls_sha512_update(&sha512Scontext, messageChunks[i].buffer,
                            messageChunks[i].length);
   }

   // Compute SHA512(dom2(F, C) || R || A || PH(M)) and interpret the 64-octet
   // digest as a little-endian integer k
   mbedtls_sha512_finish(&sha512Scontext, state->k);
   mbedtls_sha512_free(&sha512Scontext);

   // Compute S = (r + k * s) mod L. For efficiency, reduce k modulo L first
   ed25519RedInt(state->p, state->k);
   ed25519MulInt(state->k, state->k + 32, state->p, state->s, 32);
   ed25519RedInt(state->p, state->k);
   ed25519AddInt(state->s, state->p, state->r, 32);

   // Perform modular reduction
   c = ed25519SubInt(state->p, state->s, ED25519_L, 32);
   ed25519SelectInt(signature + 32, state->p, state->s, c, 32);

   // Erase working state
   memset(state, 0, sizeof(Ed25519State));

   // Release working state
   free(state);

   // Successful processing
   return 0;
}

int ed25519GenerateSignature(const uint8_t *privateKey,
                             const uint8_t *publicKey, const void *message, size_t messageLen,
                             const void *context, uint8_t contextLen, uint8_t flag, uint8_t *signature)
{
   int error;
   EddsaMessageChunk messageChunks[2];

   // The message fits in a single chunk
   messageChunks[0].buffer = message;
   messageChunks[0].length = messageLen;
   messageChunks[1].buffer = NULL;
   messageChunks[1].length = 0;

   // Ed25519 signature generation
   error = ed25519GenerateSignatureEx(privateKey, publicKey, messageChunks,
                                      context, contextLen, flag, signature);

   // Return status code
   return error;
}